import React from 'react';
import logo from './logo.svg';
import './App.css';
import Kanban from './components/Kanban/Kanban'

const data = [
  {
    title : 'افزایش فروش پوینتر 1',
    subtitle : 'جذب 10 نماینده از مشاوران',
    items : [
      {title : 'برگزاری رویداد معرفی محصول 1'},
      {title : 'برگزاری رویداد معرفی محصول 2'},
      {title : 'برگزاری رویداد معرفی محصول 3'},
      {title : 'برگزاری رویداد معرفی محصول 4'},
      {title : 'برگزاری رویداد معرفی محصول 5'},
    ] 
  },
  {
    title : 'افزایش فروش پوینتر 2',
    subtitle : 'جذب 10 نماینده از مشاوران',
    items : [
      {title : 'برگزاری رویداد معرفی محصول 6'},
      {title : 'برگزاری رویداد معرفی محصول 7'},
      {title : 'برگزاری رویداد معرفی محصول 8'},
      {title : 'برگزاری رویداد معرفی محصول 9'},
    ] 
  },
  {
    title : 'افزایش فروش پوینتر 3',
    subtitle : 'جذب 10 نماینده از مشاوران',
    items : [
      {title : 'برگزاری رویداد معرفی محصول 10 گزاری رویداد معرفی محصول گزاری رویداد معرفی محصول گزاری رویداد معرفی محصول'},
      {title : 'برگزاری رویداد معرفی محصول 11'},
      {title : 'برگزاری رویداد معرفی محصول 12'},
      {title : 'برگزاری رویداد معرفی محصول 11'},
      {title : 'برگزاری رویداد معرفی محصول 12'},
      {title : 'برگزاری رویداد معرفی محصول 11'},
      {title : 'برگزاری رویداد معرفی محصول 12'},
      {title : 'برگزاری رویداد معرفی محصول 11'},
      {title : 'برگزاری رویداد معرفی محصول 12'},
      {title : 'برگزاری رویداد معرفی محصول 11'},
      {title : 'برگزاری رویداد معرفی محصول 12'},
    ] 
 }
]



function App() {
  return (
    <Kanban
      rtl={true}
      data = {data}
      change={(val)=>{
        console.log(val)
      }}
    />
  );
}

export default App;
